During upgrade pressure drop calculations for hydronic piping systems using Simplified Colebrook or Custom Calculation methods have been recalculated using the Colebrook equation.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.420)
 Syntax
  C#
public static FailureDefinitionId FlowAndPressureCalculationMethodHasBeenImproved { get; }
  Visual Basic
Public Shared ReadOnly Property FlowAndPressureCalculationMethodHasBeenImproved As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ FlowAndPressureCalculationMethodHasBeenImproved {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures MEPCalculationFailures Class
  Autodesk.Revit.DB Namespace